app/controllers/projects_controller.rb

	def create
		# @project = Project.new(params[:project])

		if @project.save!
---
INSERT INTO `projects` (`abstract`, `budget`, `created_at`, `description`, `title`, `updated_at`) VALUES ('Sentiment Analysis', 100000000.0, '2015-05-18 08:57:20', 'Analyze ur sentiments', 'Opinio', '2015-05-18 08:57:20')

	def update
		# @project = Project.find(params[:id])
		@project.update_attributes(params[:project])
---
UPDATE `projects` SET `abstract` = 'Sent Analysis', `updated_at` = '2015-05-18 09:57:22' WHERE `projects`.`id` = 1

	def destroy
		# Project.find(params[:id]).destroy
		@projects.destroy
---
DELETE FROM `projects` WHERE `projects`.`id` = 2

	def find_project
		@project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1